In [1]:
import pandas as pd

In [2]:
data = {
    "Name": [
        "Amit", "Neha", "Rahul", "Pooja", "Vikas",
        "Anjali", "Rohit", "Sneha", "Karan", "Priya"
    ],
    "Age": [
        25, 28, 30, 24, 35,
        27, 32, 26, 29, 31
    ],
    "Salary": [
        35000, 42000, 55000, 30000, 65000,
        48000, 60000, 40000, 52000, 58000
    ],
    "Performance_Score": [
        78, 85, 90, 72, 88,
        82, 91, 80, 86, 89
    ]
}

df=pd.DataFrame(data)

In [3]:
print(df)

     Name  Age  Salary  Performance_Score
0    Amit   25   35000                 78
1    Neha   28   42000                 85
2   Rahul   30   55000                 90
3   Pooja   24   30000                 72
4   Vikas   35   65000                 88
5  Anjali   27   48000                 82
6   Rohit   32   60000                 91
7   Sneha   26   40000                 80
8   Karan   29   52000                 86
9   Priya   31   58000                 89

How to modify the data

In [5]:
#adding columns

#10% increment in salary


df["Bonus"]=df['Salary']*0.1
print(df)

     Name  Age  Salary  Performance_Score   Bonus
0    Amit   25   35000                 78  3500.0
1    Neha   28   42000                 85  4200.0
2   Rahul   30   55000                 90  5500.0
3   Pooja   24   30000                 72  3000.0
4   Vikas   35   65000                 88  6500.0
5  Anjali   27   48000                 82  4800.0
6   Rohit   32   60000                 91  6000.0
7   Sneha   26   40000                 80  4000.0
8   Karan   29   52000                 86  5200.0
9   Priya   31   58000                 89  5800.0

In [ ]:
#adding column using index method(at precise location not at last)

#df.inser(location,column name,data)

# df.insert(2,"Emp_Id",[11,12,13,14,15,16,17,18,19,20])
# print(df)

In [ ]:
#df.loc[row_index,colum_name]=new value
#when to modify particular row  a specific data
df.loc[3,'Salary']=90000
print(df)

     Name  Age  Emp_Id  Salary  Performance_Score   Bonus
0    Amit   25      11   35000                 78  3500.0
1    Neha   28      12   42000                 85  4200.0
2   Rahul   30      13   55000                 90  5500.0
3   Pooja   24      14   90000                 72  3000.0
4   Vikas   35      15   65000                 88  6500.0
5  Anjali   27      16   48000                 82  4800.0
6   Rohit   32      17   60000                 91  6000.0
7   Sneha   26      18   40000                 80  4000.0
8   Karan   29      19   52000                 86  5200.0
9   Priya   31      20   58000                 89  5800.0

In [14]:
df['Salary']=df['Salary']*0.5
print(df)

     Name  Age  Emp_Id     Salary  Performance_Score   Bonus
0    Amit   25      11   437500.0                 78  3500.0
1    Neha   28      12   525000.0                 85  4200.0
2   Rahul   30      13   687500.0                 90  5500.0
3   Pooja   24      14  1125000.0                 72  3000.0
4   Vikas   35      15   812500.0                 88  6500.0
5  Anjali   27      16   600000.0                 82  4800.0
6   Rohit   32      17   750000.0                 91  6000.0
7   Sneha   26      18   500000.0                 80  4000.0
8   Karan   29      19   650000.0                 86  5200.0
9   Priya   31      20   725000.0                 89  5800.0

In [15]:
#removing columns

#inplace true means modifying original data and if false than give copy


df.drop(columns=["Emp_Id"],inplace=True)
print(df)

     Name  Age     Salary  Performance_Score   Bonus
0    Amit   25   437500.0                 78  3500.0
1    Neha   28   525000.0                 85  4200.0
2   Rahul   30   687500.0                 90  5500.0
3   Pooja   24  1125000.0                 72  3000.0
4   Vikas   35   812500.0                 88  6500.0
5  Anjali   27   600000.0                 82  4800.0
6   Rohit   32   750000.0                 91  6000.0
7   Sneha   26   500000.0                 80  4000.0
8   Karan   29   650000.0                 86  5200.0
9   Priya   31   725000.0                 89  5800.0

In [ ]:
#for deleteing multiple columns

# df.drop(columns=["col1","col2"],inplace=True)